Autodesk.Revit.VSTA.DocumentEntryPoint.GetPlacementTypes(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.View)
Get a collection of valid placement types for input family symbol.
familySymbol:
The family symbol.
pDBView:
The view in which the family instance will be placed in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.VSTA.DocumentEntryPoint.SaveAs(Autodesk.Revit.UI.UISaveAsOptions)
Saves the document to a file name obtained from the Revit user optionally prompting the user to overwrite file if it exists.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
options:
UI options for the SaveAs operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to save the document.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Thrown if saving is cancelled by an external application during 'DocumentSavingAs' event.
Since:
2016

Autodesk.Revit.VSTA.DocumentEntryPoint.CanPlaceElementType(Autodesk.Revit.DB.ElementType)
Verifies that the user can be prompted to place the input element type on the current active view.
elementType:
The ElementType.
Returns:
True if the user can be prompted to place the input element type on the active view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.VSTA.DocumentEntryPoint.PromptToMatchElementType(Autodesk.Revit.DB.ElementType)
Prompts the user to select elements to change them to the input type.
Remarks:
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can select multiple elements to be modified to the given type, until they finish.
elementType:
The ElementType applied to selected instances.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
Since:
2015

Autodesk.Revit.VSTA.DocumentEntryPoint.PromptToPlaceElementTypeOnLegendView(Autodesk.Revit.DB.ElementType)
Prompts the user to place an element type onto a legend view.
Remarks:
This method works only for non-annotation element types.
For annotations, use PromptForFamilyInstancePlacement(Autodesk::Revit::DB::FamilySymbol) instead.
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
The user is not permitted to change the active legend view or
during this placement operation (the operation will be cancelled).
In a single invocation, the user can place multiple instances of the input element type until they finish the
placement (with Cancel or ESC or a click elsewhere in the UI).
elementType:
The ElementType of which instances are to be placed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input element type does not belong to a model-level category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
-or-
Thrown when the active view isn't a legend view.
-or-
Can not create this kind of element in legend view.
Since:
2015

Autodesk.Revit.VSTA.DocumentEntryPoint.PostRequestForElementTypePlacement(Autodesk.Revit.DB.ElementType)
Places a request on Revit's command queue for the user to place instances of the specified ElementType.  This does not execute immediately,
but instead when control returns to Revit from the current API context.
Remarks:
This method starts its own transaction.  In a single invocation, the user can place multiple instances of the input element type
until they finish the placement (with Cancel or ESC or a click elsewhere in the UI).  This method invokes the UI when control returns
from the current API context; because of this, the normal Revit UI options will be available to the user,  but the API will not be
notified when the user has completed this action.  Because this request is queued to run at the end of the current API context,
only one such request can be set (between this and the commands set by UIApplication.PostCommand()).  This differs from
PromptForFamilyInstancePlacement() as that method can be run within the current API context, but the user is not permitted
full access to the user interface options during placement.
elementType:
The ElementType of which instances are to be placed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The user cannot be prompted to place the input type on the active view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
Since:
2015

Autodesk.Revit.VSTA.DocumentEntryPoint.PromptToPlaceViewOnSheet(Autodesk.Revit.DB.View,System.Boolean)
Prompts the user to place a specified view onto a sheet.
Remarks:
This method opens its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can place only one view onto the active sheet.
The user is not permitted to change the active sheet view or the view to be placed
during this placement operation (the operation will be cancelled).
The user can cancel the placement operation by pressing Cancel or ESC or a click elsewhere in the UI.
view:
The view to insert onto a sheet.
allowReplaceExistingSheetViewport:
A indicator which allows the user to replace the existing viewport.
If true, the viewport representing this view will be replaced by the new viewport created during placement.
If the view is allowed only to be on one sheet, this will remove the viewport from the old sheet.
If the view is allowed to be on multiple sheets, and the view is currently placed on the active sheet,
the old viewport on this sheet will be replaced.
If false, if the view is only allowed to be on one sheet,
or if the view is allowed to be on multiple sheets but is already on the active sheet, an exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This view is a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
-or-
The active view isn't a sheet where a view can be placed.
-or-
Thrown when replacing an existing viewport isn't allowed. See allowReplaceExistingSheetViewport parameter documentation for details.
Since:
2015

Autodesk.Revit.VSTA.DocumentEntryPoint.GetSketchGalleryOptions(Autodesk.Revit.DB.FamilySymbol)
Gets the valid sketch gallery options of a family symbol.
familySymbol:
The family symbol.
Returns:
The valid list of SketchGalleryOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.VSTA.DocumentEntryPoint.#ctor(Autodesk.Revit.DB.Document)
Use a database level Document to construct a UI-level Document.
document:
The database level document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a primary document, it is a linked document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL